docs/profile_en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-09 Mon 21:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Takaaki FUKAI (深井貴明)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Takaaki FUKAI" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Takaaki FUKAI (深井貴明)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org75cb404">Affiliation</a></li>
<li><a href="#orgcfd332f">Contact</a></li>
<li><a href="#org1ca195f">Research Interests</a></li>
<li><a href="#orgebf8e47">Degrees</a></li>
<li><a href="#orgfa976a8">Publications</a></li>
<li><a href="#orgf1a15b6">Awards</a></li>
<li><a href="#orgad9b9b1">Grants</a></li>
<li><a href="#orgae12d5e">Research activities</a></li>
<li><a href="#orgef0fad0">Work Experience</a></li>
<li><a href="#org9a0bd5d">Other Activity</a></li>
<li><a href="#org2a30e63">Update History</a></li>
</ul>
</div>
</div>
<p>
Japanese version is <a href="./profile_jp.html">here</a><br />
</p>
<div id="outline-container-org75cb404" class="outline-2">
<h2 id="org75cb404">Affiliation</h2>
<div class="outline-text-2" id="text-org75cb404">
<p>
Senior Researcher in <a href="https://www.ipri.aist.go.jp/ccarg/en/index.html">Intelligent Platforms Research Institute, National Institute of Advanced Industrial Science and Technology (AIST)</a><br />
</p>
</div>
</div>

<div id="outline-container-orgcfd332f" class="outline-2">
<h2 id="orgcfd332f">Contact</h2>
<div class="outline-text-2" id="text-orgcfd332f">
<dl class="org-dl">
<dt>E-mail</dt><dd>takaaki.fukai (at) aist.go.jp<br /></dd>
<dt>Address</dt><dd>2-3-26 Aomi, Koto-ku, Tokyo 135-0064, Japan<br /></dd>
</dl>
</div>
</div>

<div id="outline-container-org1ca195f" class="outline-2">
<h2 id="org1ca195f">Research Interests</h2>
<div class="outline-text-2" id="text-org1ca195f">
<ul class="org-ul">
<li>Lightweight virtualization software (Hypervisor)<br />
<ul class="org-ul">
<li><a href="https://www.bitvisor.org/">BitVisor</a><br /></li>
<li><a href="https://github.com/RIKEN-RCCS/MilvusVisor">MilvusVisor</a><br /></li>
</ul></li>
<li>Computer security<br />
<ul class="org-ul">
<li>Confidential VM<br /></li>
<li>Discovery of system software vulnerabilities<br /></li>
</ul></li>
<li>Data center management techniques<br />
<ul class="org-ul">
<li>Management of bare-metal instances in clouds<br /></li>
<li>HPC system providing user root privilege<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgebf8e47" class="outline-2">
<h2 id="orgebf8e47">Degrees</h2>
<div class="outline-text-2" id="text-orgebf8e47">
<ul class="org-ul">
<li>September 2018, Doctor of Philosophy in Engineering, University of Tsukuba<br /></li>
<li>March 2015, Master of Engineering, University of Tsukuba<br /></li>
<li>March 2013, Bachelor of Engineering, Okayama University<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgfa976a8" class="outline-2">
<h2 id="orgfa976a8">Publications</h2>
<div class="outline-text-2" id="text-orgfa976a8">
</div>
<ul class="org-ul">
<li><a id="orge7b8ce6"></a>Journal Paper<br />
<div class="outline-text-3" id="text-orge7b8ce6">
<ol class="org-ol">
<li>Takahiro Hirofuchi, Akram Ben Ahmed, <span class="underline">Takaaki Fukai</span>.<br />
<b>Implementation and Evaluation of a Time-Sensitive Networking Endpoint for Asynchronous Traffic Shaping.</b><br />
IEEE Access,<br />
Feb. 2026.<br />
(Open Access: <a href="https://ieeexplore.ieee.org/document/11372664">https://ieeexplore.ieee.org/document/11372664</a>)<br /></li>
<li>Akram Ben Ahmed, Takahiro Hirofuchi, <span class="underline">Takaaki Fukai</span>.<br />
<b>Hardware Design and Evaluation of an FPGA-Based Network Switch Supporting Asynchronous Traffic Shaping for Time Sensitive Networking.</b><br />
IEEE Access,<br />
Aug. 2024.<br />
(Open Access: <a href="https://ieeexplore.ieee.org/document/10658978">https://ieeexplore.ieee.org/document/10658978</a>)<br /></li>
<li><span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa, Kazuhiko Kato.<br />
<b>Live Migration in Bare-metal Clouds.</b><br />
IEEE Transactions on Cloud Computing,<br />
Jul. 2018.<br />
(Open Access: <a href="https://ieeexplore.ieee.org/document/8401692">https://ieeexplore.ieee.org/document/8401692</a>)<br /></li>
</ol>
</div>
</li>

<li><a id="org67e1f88"></a>International Conference Papers (Refereed)<br />
<div class="outline-text-3" id="text-org67e1f88">
<ol class="org-ol">
<li>Reima Ishii, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>NecoFuzz: Effective Fuzzing of Nested Virtualization via Fuzz-Harness Virtual Machines.</b><br />
In Proceedings of the 2026 European Conference on Computer Systems (EuroSys 2026).<br />
(To appear)<br /></li>
<li>Satoru Takekoshi, Manami Mori, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>BadAML: Exploiting Legacy Firmware Interfaces to Compromise Confidential Virtual Machines.</b><br />
Proceedings of the 2025 ACM SIGSAC Conference on Computer and Communications Security (CCS 2025),<br />
Oct. 2025.<br />
<b>[Distinguished Paper Award]</b>.<br /></li>
<li>Akram Ben Ahmed, Takahiro Hirofuchi, <span class="underline">Takaaki Fukai</span>.<br />
<b>EFCC: Ethernet Frame Crafter &amp; Capture for TSN Research.</b><br />
2025 IEEE 50th Conference on Local Computer Networks (LCN),<br />
Oct. 2025.<br /></li>
<li>Itsuki Nakai, <span class="underline">Takaaki Fukai</span>, Takahiro Hirofuchi, Yukinori Sato.<br />
<b>Comprehensive Performance Evaluation of Microservices on Confidential Containers in Mutli-access Edge Computing Environments.</b><br />
2025 IEEE International Conference on Cloud Engineering (IC2E),<br />
Sep. 2025.<br /></li>
<li>Akram BEN Ahmed, Takahiro Hirofuchi, <span class="underline">Takaaki Fukai</span>.<br />
<b>FPGA-Based Network Switch Architecture Supporting Credit Based Shaper for Time Sensitive Networks.</b><br />
2024 IEEE 29th International Conference on Emerging Technologies and Factory Automation (ETFA),<br />
Sep. 2024.<br /></li>
<li><span class="underline">Takaaki Fukai</span>, Kento Sato and Takahiro Hirofuchi.<br />
<b>Analyzing I/O Performance of a Hierarchical HPC Storage System for Distributed Deep Learning</b><br />
In Proceedings of the 23rd International Conference on Parallel and Distributed Computing, Applications and Technologies (PDCAT’22)<br />
Dec 2022.<br /></li>
<li>Tabuchi, Akihiro and Shirahata, Koichi and Yamazaki, Masafumi and Kasagi, Akihiko and Honda, Takumi and Kurihara, Kouji and Kawakami, Kentaro and Tabaru, Tsuguchika and Fukumoto, Naoto and Kuroda, Akiyoshi and <span class="underline">Fukai, Takaaki</span> and Sato, Kento<br />
<b>The 16,384-node Parallelism of 3D-CNN Training on An Arm CPU based Supercomputer</b><br />
2021 IEEE 28th International Conference on High Performance Computing, Data, and Analytics (HiPC)<br />
Dec. 2021.<br /></li>
<li>Masanori Misono, Masahiro Ogino, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>FaultVisor2: Testing Hypervisor Device Drivers against Real Hardware Failures.</b><br />
In Proceedings of the 10th IEEE International Conference on Cloud Computing Technology and Science (CloudCom 2018),<br />
Dec 2018. (Acceptance Ratio: 19.8%) <b>[Best paper award]</b>.<br /></li>
<li>Iori Yoneji, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa and Kazuhiko Kato.<br />
<b>Unified Hardware Abstraction Layer with Device Masquerade.</b><br />
In Proceedings of the 33rd ACM Symposium On Applied Computing (ACM SAC 2018),<br />
Apr 2018.<br /></li>
<li><span class="underline">Takaaki Fukai</span>, Satoru Takekoshi, Kohei Azuma, Takahiro Shinagawa and Kazuhiko Kato.<br />
<b>BMCArmor: A Hardware Protection Scheme for Bare-Metal Clouds.</b><br />
In Proceedings of the 9th IEEE International Conference on Cloud Computing Technology and Science (CloudCom 2017),<br />
Dec 2017.<br /></li>
<li><span class="underline">Takaaki Fukai</span>, Yushi Omote, Takahiro Shinagawa, Kazuhiko Kato.<br />
<b>OS-Independent Live Migration Scheme for Bare-metal Clouds.</b><br />
In Proceedings of the 8th IEEE/ACM International Conference on Utility and Cloud Computing,<br />
Dec 2015.<br />
<b>[Best paper award]</b>.<br /></li>
</ol>
</div>
</li>
