docs/profile_en.html

<li><a id="org900f857"></a>International Workshop Papers (Refereed)<br />
<div class="outline-text-3" id="text-org900f857">
<ol class="org-ol">
<li><span class="underline">Takaaki Fukai</span>, Manami Mori, Ryuichi Sakamoto, Takahiro Hirofuchi, Takuya Asaka.<br />
<b>A Thin Hypervisor Approach to Multi-Tenant SmartNICs in Edge Data Centers.</b><br />
Proceedings of the 8th International Workshop on Edge Systems, Analytics and Networking,<br />
Mar. 2025.<br /></li>
<li>Farrell, Steven and Emani, Murali and Balma, Jacob and Drescher, Lukas and Drozd, Aleksandr and Fink, Andreas and Fox, Geoffrey and Kanter, David and Kurth, Thorsten and Mattson, Peter and Mu, Dawei and Ruhela, Amit and Sato, Kento and Shirahata, Koichi and Tabaru, Tsuguchika and Tsaris, Aristeidis and Balewski, Jan and Cumming, Ben and Danjo, Takumi and Domke, Jens and <span class="underline">Fukai, Takaaki</span> and Fukumoto, Naoto and Fukushi, Tatsuya and Gerofi, Balazs and Honda, Takumi and Imamura, Toshiyuki and Kasagi, Akihiko and Kawakami, Kentaro and Kudo, Shuhei and Kuroda, Akiyoshi and Martinasso, Maxime and Matsuoka, Satoshi and Mendon&ccedil;a, Henrique and Minami, Kazuki and Ram, Prabhat and Sawada, Takashi and Shankar, Mallikarjun and John, Tom St. and Tabuchi, Akihiro and Vishwanath, Venkatram and Wahib, Mohamed and Yamazaki, Masafumi and Yin, Junqi.<br />
<b>MLPerf&trade; HPC: A Holistic Benchmark Suite for Scientific Machine Learning on HPC Systems.</b><br />
2021 IEEE/ACM Workshop on Machine Learning in High Performance Computing Environments (MLHPC).<br />
November 2021.<br /></li>
<li>Ilias Avramidis, Michael Mackay, Posco Tso, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>Live Migration on ARM-based Micro-datacentres.</b><br />
In Proceedings of the 3rd Workshop on Edge Computing (EdgeCom 2018),<br />
Jan 2018.<br /></li>
</ol>
</div>
</li>

<li><a id="org0e56dab"></a>Domestic Workshop Papers (Non-Refereed)<br />
<div class="outline-text-3" id="text-org0e56dab">
<p>
(Sorry for information in Japanese, but there is no official information in English)<br />
</p>

<ol class="org-ol">
<li>大野 健太朗, 宮島 敬明, <span class="underline">深井 貴明</span> ．<br />
<b>異種Armプロセッサにおける軽量ハイパバイザによる性能への影響の比較と分析．</b><br />
第169回 システムソフトウェアとオペレーティング・システム研究会．<br />
2025年9月．<br /></li>
<li>広渕 崇宏, アクラム ベン アーメッド, <span class="underline">深井 貴明</span>.<br />
<b>Asynchronous Traffic Shaping (ATS)に対応したTime-sensitive network (TSN)エンドポイントの試作</b><br />
電子情報通信学会 信学技報, vol. 124, no. 438, CPSY2024-58, pp. 79-84.<br />
2025年3月.<br /></li>
<li>宮川 大輝, <span class="underline">深井 貴明</span>, 李 彦志, 広渕 崇宏, 菅谷 みどり．<br />
<b>ベアメタル環境におけるSmartNICを用いたOSイメージ展開手法の設計と実装．</b><br />
第166回 システムソフトウェアとオペレーティング・システム研究会．<br />
2025年3月．<br /></li>
<li>Akram Ben Ahmed, Takahiro Hirofuchi, <span class="underline">Takaaki Fukai</span>.<br />
<b>Preliminary Report on an FPGA-based Prototype of a Network Switch Supporting Asynchronous Traffic Shaping for Time Sensitive Networking</b><br />
電子情報通信学会 信学技報, vol. 124, no. 74, RECONF2024-5, pp. 23-29.<br />
2024年6月.<br /></li>
<li>飯田 圭祐(†), <span class="underline">深井 貴明</span>, 広渕 崇宏, 松谷 健史．<br />
<b>軽量ハイパバイザのSR-IOVデバイス制御における性能劣化削減手法．</b><br />
第163回 システムソフトウェアとオペレーティング・システム研究会．<br />
2024年5月．<br />
†: <b>Outstanding Presentation Award</b><br /></li>
<li>相馬 大地, 石黒 健太, <span class="underline">深井 貴明</span>, 広渕 崇宏, 河野 健二．<br />
<b>資源集約時における低遅延通信のためのSmartNICを活用したスケジューリング支援．</b><br />
第163回 システムソフトウェアとオペレーティング・システム研究会．<br />
2024年5月．<br /></li>
<li>Akram Ben Ahmed, Takahiro Hirofuchi, <span class="underline">Takaaki Fukai</span>.<br />
<b>Implementation and Preliminary Evaluation of an FPGA-based Network Switch Supporting Credit-based Shaper for Time Sensitive Networks.</b><br />
電子情報通信学会 信学技報, vol. 124, no. 2, NS2024-11, pp. 47-52.<br />
2024年4月.<br /></li>
<li>中井 樹, <span class="underline">深井 貴明</span>, 広渕 崇宏, 佐藤 幸紀．<br />
<b>メモリ暗号化されたクラウドシステム基盤の性能評価．</b><br />
電子情報通信学会 信学技報, vol. 123, no. 450, CPSY2023-50, pp. 71-76．<br />
(組込み技術とネットワークに関するワークショップ ETNET2024)<br />
2024年3月．<br /></li>
<li>森 真誠, <span class="underline">深井 貴明</span>, 広渕 崇宏, 朝香 卓也．<br />
<b>I/Oデバイス内部の汎用プロセッサにおける軽量な隔離実行環境．</b><br />
第162回 システムソフトウェアとオペレーティング・システム研究会．<br />
2024年2月．<br /></li>
<li>石井 玲真(†), <span class="underline">深井 貴明</span>, 品川 高廣．<br />
<b>ネステッド仮想化のファジングにおけるカバレッジ向上に向けて．</b><br />
第159回 システムソフトウェアとオペレーティング・システム研究会．<br />
2023年5月．<br />
†: <b>Outstanding Presentation Award</b><br /></li>
<li>葛野 弘樹, <span class="underline">深井 貴明</span> ．<br />
<b>新規仮想化ソフトウェアのセキュア実装に向けた既存実装の脆弱性分類の検討．</b><br />
情報処理学会 第85回全国大会講演論文集，<br />
2023年2月．<br /></li>
<li>森 真誠(†), <span class="underline">深井 貴明</span>, 山本 啓二, 広渕 崇宏, 朝香 卓也．<br />
<b>Root権限使用可能なArmスパコン実現に向けた軽量ハイパバイザの設計と実装．</b><br />
第157回 システムソフトウェアとオペレーティング・システム研究会．<br />
2022年9月．<br />
†: <b>Best presentation award</b><br /></li>
<li>長塚 向紀, <span class="underline">深井 貴明</span>, 山本 啓二, 宮島 敬明, 広渕 崇宏．<br />
<b>Armプロセッサにおける軽量ハイパバイザの性能評価．</b><br />
第157回 システムソフトウェアとオペレーティング・システム研究会．<br />
2022年9月．<br /></li>
<li><span class="underline">深井 貴明</span>, 広渕 崇宏, 高野 了成, Akram Ben Ahmed, 佐藤 賢斗．<br />
<b>FPGAによる次世代メモリのエミュレーション機構．</b><br />
第180回 ハイパフォーマンスコンピューティング研究発表会 (SWoPP2021)<br />
2021年7月．<br /></li>
<li>荻野 将拓, 味曽野 雅史, <span class="underline">深井 貴明</span>, 品川 高廣．<br />
<b>ハードウェア障害に対するハイパーバイザの対故障性検証．</b><br />
第143回 システムソフトウェアとオペレーティング・システム研究会．<br />
2018年5月<br /></li>
<li>東 耕平, 竹腰 開, <span class="underline">深井 貴明</span>, 品川 高廣, 加藤 和彦<br />
<b>ベアメタルクラウドにおけるハードウェア保護</b><br />
第136回 システムソフトウェアとオペレーティング・システム研究会．<br />
2016年2月<br /></li>
<li><span class="underline">深井 貴明</span> ，表 祐志，品川 高廣，加藤 和彦．<br />
  <b>物理マシン間のライブマイグレーション手法の提案</b><br />
  第127回 システムソフトウェアとオペレーティング・システム研究会．<br />
  2013年12月<br />
<a href="./files/OS127-fukai.pdf">PDF</a> <a href="./ipsjnotice.html">ここに掲載した著作物の利用に関する注意</a><br /></li>
</ol>
</div>
</li>
