profile_en.org
** International Conference/Workshop Posters (Refereed)

   1. Yoshifumi Shu, _Takaaki Fukai_, Takahiro Shinagawa.
      *Coverage-Based Debloating of Linux Kernel Configurations for Real Machine Environments.*
      The 31st Symposium on Operating Systems Principles (SOSP 2025).
      Oct. 2025.

   2. _Takaaki Fukai_, Manami Mori, Keiji Yamamoto, Takahiro Hirofuchi, Takuya Asaka.
      *Toward Providing Root Privilege to Flagship HPC Users with Thin-Hypervisor.*
      2024 IEEE International Conference on Cluster Computing Workshops (CLUSTER Workshops),
      Sep. 2024.

   3. Itsuki Nakai, _Takaaki Fukai_, Takahiro Hirofuchi, Yukinori Sato.
      *Performance Evaluation of Confidential Containers in the Edge-Cloud Computing Continuum.*
      15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).
      Sep. 2024.

   4. Taiki Miyakawa, _Takaaki Fukai_, Li Yanzhi, Takahiro Hirofuchi, Midori Sugaya.
      *Toward Optimizing OS Image Deployment Using SmartNIC.*
      15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).
      Sep. 2024.

   5. Manami Mori, _Takaaki Fukai_, Ryuichi Sakamoto, Takahiro Hirofuchi, Takuya Asaka.
      *A lightweight isolated execution environment in SmartNIC.*
      15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).
      Sep. 2024.

   6. Keisuke Iida, _Takaaki Fukai_, Takahiro Hirofuchi, Takeshi Matsuya.
      *Design of SR-IOV Driver to Mitigate Performance Degradation for Lightweight Hypervisor.*
      15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).
      Sep. 2024.

   7. Reima Ishii, _Takaaki Fukai_, Takahiro Shinagawa.
      *Toward Efficient Fuzzing of Nested Virtualization.*
      17th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2023).
      Jul. 2023.

   8. _Takaaki Fukai_ and Kento Sato.
      *Measurement of I/O Performance on a Hierarchical File System for Distributed Deep Neural Network.*
      The 4th R-CCS International symposium
      February, 2022.

   9. _Takaaki Fukai_ and Kento Sato.
      *Performance Measurement of a Hierarchical File System for Distributed Deep Neural Network Training.*
      The International Conference on High Performance Computing in Asia-Pacific Region (HPC Asia 2022)
      January, 2022.

   10. _Takaaki Fukai_ and Kento Sato.
       *Measurement of I/O performance for distributed deep neural networks on Fugaku*.
       The 3rd R-CCS International Symposium 2021.
       February, 2021.

   11. Ryosuke Yasuoka, _Takaaki Fukai_ and Takahiro Shinagawa.
       *Toward On-demand Nested Virtualization for Live-Refreshing Cloud Systems*.
       The Fifteenth EuroSys Conference 2020 (EuroSys ’20).
       April, 2020 (To be appear).

   12. _Takaaki Fukai_, Yushi Omote, Takahiro Shinagawa, and Kazuhiko Kato.
      *Live Migration of Bare-metal Instances*
      5th Asia-Pacific Workshop on Systems (APSys 2014).
      June, 2014

** Domestic Workshop Posters (Non-Refereed)
   (Sorry for information in Japanese, but there is no official information in English)

  1. 藤井 大悟, 広渕 崇宏, _深井 貴明_ ．
     *ハードウェアフレームジェネレータを用いたLinuxサーバのレイテンシ分析．*
     第37回コンピュータシステム・シンポジウム (ComSys 2025).
     2025年12月.
  2. 大野 健太朗, 宮島 敬明, _深井 貴明_ ．
     *異種Armプロセッサにおける軽量ハイパバイザによる性能劣化特性の比較．*
     xSIG 2024．
     2024年8月．
  3. 広渕 崇宏, Akram Ben Ahmed, _深井 貴明_, 加藤 丈治, 高野 了成．
     *ポスト5Gを支える時間確定的なコンピューティング基盤技術の開発にむけて．*
     xSIG 2024．
     2024年8月．
  4. Akram BEN AHMED, Takahiro HIROFUCHI, _Takaaki FUKAI_.
     *Towards Open-source FPGA-based hardware support for Time Sensitive Networks.*
     xSIG 2024．
     2024年8月．
  5. Akram BEN AHMED, Takahiro HIROFUCHI, _Takaaki FUKAI_.
     *A work-in-progress report on FPGA-based hardware support of Credit Based Shaping for Time Sensitive Networks.*
     第248回システム・アーキテクチャ・第205回システムとLSIの設計技術・第65回組込みシステム合同研究発表会（ETNET2024）．
     2024年3月．
  6. 中井 樹, _深井 貴明_, 広渕 崇宏, 佐藤 幸紀．
     *メモリ暗号化されたクラウドシステム基盤の性能評価．*
     第248回システム・アーキテクチャ・第205回システムとLSIの設計技術・第65回組込みシステム合同研究発表会（ETNET2024）．
     2024年3月．
  7. 宮川 大輝, _深井 貴明_, 李 彦志, 広渕 崇宏, 菅谷みどり．
     *I/O処理オフロードに向けたSmartNICとCPUのネットワーク性能特性の比較．*
     第35回コンピュータシステム・シンポジウム (ComSys 2023).
     2023年12月.
  8. 葛野弘樹， _深井貴明_.
     *仮想化ソフトウェアのセキュア化に向けた脆弱性の調査分析.*
     第34回コンピュータシステム・シンポジウム (ComSys 2022).
     2022年12月.
  9. 安岡 亮輔， _深井 貴明_ ，品川 高廣， 加藤 和彦.
     *ネステッド仮想化の動的 ON/OFF による仮想マシンモニタ若化.*
     第28回コンピュータシステム・シンポジウム (ComSys2016).
     2016年11月.
  10. _深井 貴明_ ，表 祐志，品川 高廣，加藤 和彦．
      *物理マシン間のライブマイグレーション手法の提案.*
      第11回 ディペンダブルシステムワークショップ (DSW 2013).
      2013年12月.
  11. _深井 貴明_ ，表 祐志，品川 高廣，加藤 和彦．
      *物理マシン間のライブマイグレーション手法の提案*
      第25回コンピュータシステム・シンポジウム (ComSys2013).
      2013年12月.

** Invited talk (Domestic)
   1. _深井 貴明_ ．
      クラウド、HPC、エッジにおける軽量ハイパバイザの研究
      第158回システムソフトウェアとオペレーティング・システム研究会 若手招待講演．
      2023年2月


** Other presentation (International)
   1. Satoru Takekoshi, Manami Mori, _Takaaki Fukai_, Takahiro Shinagawa.
      AML Injection Attacks on Confidential VMs
      BlackHat EU 2024.
      Dec. 2024.
      https://blackhat.com/eu-24/briefings/schedule/#aml-injection-attacks-on-confidential-vms-42723

** Other presentations (Domestic)
   (Sorry for information in Japanese, but there is no official information in English)

   1.  _深井 貴明_
      トップカンファレンス・ジャーナル採択論文講演
      (採択論文情報: Takaaki Fukai, Takahiro Shinagawa, Kazuhiko Kato, "Live Migration in Bare-metal Clouds", IEEE Transactions on Cloud Computing, July 2018.)
      第31回コンピュータシステム・シンポジウム (ComSys2019）

* Awards
  1. *Distinguished Paper Award*
    ACM SIGSAC Conference on Computer and Communications Security (CCS 2025)

  2. *IEEE Computer Society Japan Chapter Young Author Award 2019*
     IEEE Computer Society Tokyo/Japan Joint Chapter, December 2019

  3. *Best Paper Award*
     The 10th IEEE International Conference on Cloud Computing Technology and Science, December 2018

  4. *Best Paper Award*
     The 8th IEEE/ACM International Conference on Utility and Cloud Computing, December 2015

  5. *岡山大学工学部優秀学生賞*
     Faculty of Engineering, Okayama University, March 2013

* Grants
** Principal Investigator
- 「共用 HPC における管理者権限の利用を許す計算資源提供」 Grant-in-Aid for Early-Career Scientists, Japan Society for the Promotion of Science(JSPS), April 2021--March 2024.

* Research activities
** Editorial Board Member
- April 2025--Present: Editorial board member of IPSJ Transactions on Advanced Computing Systems
- April 2022--March 2026: Editorial committee member (SWG) of IPSJ Magazine
- April 2020--March 2024: Editorial board member IPSJ Transactions on Advanced Computing Systems

