docs/profile_en.html
<li><a id="org2ac5a63"></a>International Conference/Workshop Posters (Refereed)<br />
<div class="outline-text-3" id="text-org2ac5a63">
<ol class="org-ol">
<li>Yoshifumi Shu, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>Coverage-Based Debloating of Linux Kernel Configurations for Real Machine Environments.</b><br />
The 31st Symposium on Operating Systems Principles (SOSP 2025).<br />
Oct. 2025.<br /></li>

<li><span class="underline">Takaaki Fukai</span>, Manami Mori, Keiji Yamamoto, Takahiro Hirofuchi, Takuya Asaka.<br />
<b>Toward Providing Root Privilege to Flagship HPC Users with Thin-Hypervisor.</b><br />
2024 IEEE International Conference on Cluster Computing Workshops (CLUSTER Workshops),<br />
Sep. 2024.<br /></li>

<li>Itsuki Nakai, <span class="underline">Takaaki Fukai</span>, Takahiro Hirofuchi, Yukinori Sato.<br />
<b>Performance Evaluation of Confidential Containers in the Edge-Cloud Computing Continuum.</b><br />
15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).<br />
Sep. 2024.<br /></li>

<li>Taiki Miyakawa, <span class="underline">Takaaki Fukai</span>, Li Yanzhi, Takahiro Hirofuchi, Midori Sugaya.<br />
<b>Toward Optimizing OS Image Deployment Using SmartNIC.</b><br />
15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).<br />
Sep. 2024.<br /></li>

<li>Manami Mori, <span class="underline">Takaaki Fukai</span>, Ryuichi Sakamoto, Takahiro Hirofuchi, Takuya Asaka.<br />
<b>A lightweight isolated execution environment in SmartNIC.</b><br />
15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).<br />
Sep. 2024.<br /></li>

<li>Keisuke Iida, <span class="underline">Takaaki Fukai</span>, Takahiro Hirofuchi, Takeshi Matsuya.<br />
<b>Design of SR-IOV Driver to Mitigate Performance Degradation for Lightweight Hypervisor.</b><br />
15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).<br />
Sep. 2024.<br /></li>

<li>Reima Ishii, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>Toward Efficient Fuzzing of Nested Virtualization.</b><br />
17th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2023).<br />
Jul. 2023.<br /></li>

<li><span class="underline">Takaaki Fukai</span> and Kento Sato.<br />
<b>Measurement of I/O Performance on a Hierarchical File System for Distributed Deep Neural Network.</b><br />
The 4th R-CCS International symposium<br />
February, 2022.<br /></li>

<li><span class="underline">Takaaki Fukai</span> and Kento Sato.<br />
<b>Performance Measurement of a Hierarchical File System for Distributed Deep Neural Network Training.</b><br />
The International Conference on High Performance Computing in Asia-Pacific Region (HPC Asia 2022)<br />
January, 2022.<br /></li>

<li><span class="underline">Takaaki Fukai</span> and Kento Sato.<br />
<b>Measurement of I/O performance for distributed deep neural networks on Fugaku</b>.<br />
The 3rd R-CCS International Symposium 2021.<br />
February, 2021.<br /></li>

<li>Ryosuke Yasuoka, <span class="underline">Takaaki Fukai</span> and Takahiro Shinagawa.<br />
<b>Toward On-demand Nested Virtualization for Live-Refreshing Cloud Systems</b>.<br />
The Fifteenth EuroSys Conference 2020 (EuroSys ’20).<br />
April, 2020 (To be appear).<br /></li>

<li><span class="underline">Takaaki Fukai</span>, Yushi Omote, Takahiro Shinagawa, and Kazuhiko Kato.<br />
<b>Live Migration of Bare-metal Instances</b><br />
5th Asia-Pacific Workshop on Systems (APSys 2014).<br />
June, 2014<br /></li>
</ol>
</div>
</li>

<li><a id="org87435c8"></a>Domestic Workshop Posters (Non-Refereed)<br />
<div class="outline-text-3" id="text-org87435c8">
<p>
(Sorry for information in Japanese, but there is no official information in English)<br />
</p>

<ol class="org-ol">
<li>藤井 大悟, 広渕 崇宏, <span class="underline">深井 貴明</span> ．<br />
<b>ハードウェアフレームジェネレータを用いたLinuxサーバのレイテンシ分析．</b><br />
第37回コンピュータシステム・シンポジウム (ComSys 2025).<br />
2025年12月.<br /></li>
<li>大野 健太朗, 宮島 敬明, <span class="underline">深井 貴明</span> ．<br />
<b>異種Armプロセッサにおける軽量ハイパバイザによる性能劣化特性の比較．</b><br />
xSIG 2024．<br />
2024年8月．<br /></li>
<li>広渕 崇宏, Akram Ben Ahmed, <span class="underline">深井 貴明</span>, 加藤 丈治, 高野 了成．<br />
<b>ポスト5Gを支える時間確定的なコンピューティング基盤技術の開発にむけて．</b><br />
xSIG 2024．<br />
2024年8月．<br /></li>
<li>Akram BEN AHMED, Takahiro HIROFUCHI, <span class="underline">Takaaki FUKAI</span>.<br />
<b>Towards Open-source FPGA-based hardware support for Time Sensitive Networks.</b><br />
xSIG 2024．<br />
2024年8月．<br /></li>
<li>Akram BEN AHMED, Takahiro HIROFUCHI, <span class="underline">Takaaki FUKAI</span>.<br />
<b>A work-in-progress report on FPGA-based hardware support of Credit Based Shaping for Time Sensitive Networks.</b><br />
第248回システム・アーキテクチャ・第205回システムとLSIの設計技術・第65回組込みシステム合同研究発表会（ETNET2024）．<br />
2024年3月．<br /></li>
<li>中井 樹, <span class="underline">深井 貴明</span>, 広渕 崇宏, 佐藤 幸紀．<br />
<b>メモリ暗号化されたクラウドシステム基盤の性能評価．</b><br />
第248回システム・アーキテクチャ・第205回システムとLSIの設計技術・第65回組込みシステム合同研究発表会（ETNET2024）．<br />
2024年3月．<br /></li>
<li>宮川 大輝, <span class="underline">深井 貴明</span>, 李 彦志, 広渕 崇宏, 菅谷みどり．<br />
<b>I/O処理オフロードに向けたSmartNICとCPUのネットワーク性能特性の比較．</b><br />
第35回コンピュータシステム・シンポジウム (ComSys 2023).<br />
2023年12月.<br /></li>
<li>葛野弘樹， <span class="underline">深井貴明</span>.<br />
<b>仮想化ソフトウェアのセキュア化に向けた脆弱性の調査分析.</b><br />
第34回コンピュータシステム・シンポジウム (ComSys 2022).<br />
2022年12月.<br /></li>
<li>安岡 亮輔， <span class="underline">深井 貴明</span> ，品川 高廣， 加藤 和彦.<br />
<b>ネステッド仮想化の動的 ON/OFF による仮想マシンモニタ若化.</b><br />
第28回コンピュータシステム・シンポジウム (ComSys2016).<br />
2016年11月.<br /></li>
<li><span class="underline">深井 貴明</span> ，表 祐志，品川 高廣，加藤 和彦．<br />
<b>物理マシン間のライブマイグレーション手法の提案.</b><br />
第11回 ディペンダブルシステムワークショップ (DSW 2013).<br />
2013年12月.<br /></li>
<li><span class="underline">深井 貴明</span> ，表 祐志，品川 高廣，加藤 和彦．<br />
<b>物理マシン間のライブマイグレーション手法の提案</b><br />
第25回コンピュータシステム・シンポジウム (ComSys2013).<br />
2013年12月.<br /></li>
</ol>
</div>
</li>

<li><a id="org50f7852"></a>Invited talk (Domestic)<br />
<div class="outline-text-3" id="text-org50f7852">
<ol class="org-ol">
<li><span class="underline">深井 貴明</span> ．<br />
クラウド、HPC、エッジにおける軽量ハイパバイザの研究<br />
第158回システムソフトウェアとオペレーティング・システム研究会 若手招待講演．<br />
2023年2月<br /></li>
</ol>
</div>
</li>


<li><a id="org7676060"></a>Other presentation (International)<br />
<div class="outline-text-3" id="text-org7676060">
<ol class="org-ol">
<li>Satoru Takekoshi, Manami Mori, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
AML Injection Attacks on Confidential VMs<br />
BlackHat EU 2024.<br />
Dec. 2024.<br />
<a href="https://blackhat.com/eu-24/briefings/schedule/#aml-injection-attacks-on-confidential-vms-42723">https://blackhat.com/eu-24/briefings/schedule/#aml-injection-attacks-on-confidential-vms-42723</a><br /></li>
</ol>
</div>
</li>

<li><a id="org32cbd2e"></a>Other presentations (Domestic)<br />
<div class="outline-text-3" id="text-org32cbd2e">
<p>
(Sorry for information in Japanese, but there is no official information in English)<br />
</p>

<ol class="org-ol">
<li><span class="underline">深井 貴明</span><br />
トップカンファレンス・ジャーナル採択論文講演<br />
(採択論文情報: Takaaki Fukai, Takahiro Shinagawa, Kazuhiko Kato, "Live Migration in Bare-metal Clouds", IEEE Transactions on Cloud Computing, July 2018.)<br />
第31回コンピュータシステム・シンポジウム (ComSys2019）<br /></li>
</ol>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgf1a15b6" class="outline-2">
<h2 id="orgf1a15b6">Awards</h2>
<div class="outline-text-2" id="text-orgf1a15b6">
<ol class="org-ol">
<li><b>Distinguished Paper Award</b><br />
ACM SIGSAC Conference on Computer and Communications Security (CCS 2025)<br /></li>

<li><b>IEEE Computer Society Japan Chapter Young Author Award 2019</b><br />
IEEE Computer Society Tokyo/Japan Joint Chapter, December 2019<br /></li>

<li><b>Best Paper Award</b><br />
The 10th IEEE International Conference on Cloud Computing Technology and Science, December 2018<br /></li>

<li><b>Best Paper Award</b><br />
The 8th IEEE/ACM International Conference on Utility and Cloud Computing, December 2015<br /></li>

<li><b>岡山大学工学部優秀学生賞</b><br />
Faculty of Engineering, Okayama University, March 2013<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgad9b9b1" class="outline-2">
<h2 id="orgad9b9b1">Grants</h2>
<div class="outline-text-2" id="text-orgad9b9b1">
</div>
<ul class="org-ul">
<li><a id="org8675c36"></a>Principal Investigator<br />
<div class="outline-text-3" id="text-org8675c36">
<ul class="org-ul">
<li>「共用 HPC における管理者権限の利用を許す計算資源提供」 Grant-in-Aid for Early-Career Scientists, Japan Society for the Promotion of Science(JSPS), April 2021&#x2013;March 2024.<br /></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgae12d5e" class="outline-2">
<h2 id="orgae12d5e">Research activities</h2>
<div class="outline-text-2" id="text-orgae12d5e">
</div>
<ul class="org-ul">
<li><a id="org491b9fd"></a>Editorial Board Member<br />
<div class="outline-text-3" id="text-org491b9fd">
<ul class="org-ul">
<li>April 2025&#x2013;Present: Editorial board member of IPSJ Transactions on Advanced Computing Systems<br /></li>
<li>April 2022&#x2013;March 2026: Editorial committee member (SWG) of IPSJ Magazine<br /></li>
<li>April 2020&#x2013;March 2024: Editorial board member IPSJ Transactions on Advanced Computing Systems<br /></li>
</ul>
</div>
</li>
