profile_en.org
** Steering Committee
- April 2024--Present: Secretary of IPSJ Special Interest Group on System Software and Operating Systems (SIGOS)
- April 2020--March 2024: Committee member of IPSJ Special Interest Group on System Software and Operating Systems (SIGOS)

** Others
- 15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024). Sponsor Chair.
- The 3rd R-CCS International Symposium 2021. Online arrangement chair.

* Work Experience
- October 2025--Present: Senior Researcher in Intelligent Platforms Research Institute, National Institute of Advanced Industrial Science and Technology (AIST)
- April 2025--September 2025: Researcher in Intelligent Platforms Research Institute, National Institute of Advanced Industrial Science and Technology (AIST)
- April 2022--March 2025: Researcher in Digital Architecture Research Center, National Institute of Advanced Industrial Science and Technology (AIST)
- January 2020--March 2022: Postdoctoral Researcher in RIKEN Center of Computational Science (R-CCS)
- April 2018-December 2019: Software Developer at IBM Japan
  - Worked as QA engineer of a web application and DevOps engineer of a cloud productions
  - Technical experience: Software test, CI/CD, Jenkins, Docker, Kubernetes, Helm

* Other Activity
  - ResearchGate :: https://www.researchgate.net/profile/Takaaki_Fukai
  - Linkedin :: https://www.linkedin.com/in/takaaki-fukai-b378a7141/?originalSubdomain=jp
  - Slideshare :: https://www.slideshare.net/DeepTokikane/presentations
  - Github :: https://github.com/fukai-t
  - Bitbucket :: https://bitbucket.org/ftakaaki/
* Update History
  - 2026/03/10 Update /Affiliation/, /Publications/, /Research activities/, and /Work Experience/
  - 2022/12/29 Update /Affiliation/, /Contact/, /Publications/, and /Work Experience/
  - 2021/09/10 Add /Grants/ and /Research activities/, Update /Work Experience/ and /Publications/
  - 2020/04/07 Update /Publications/
  - 2020/03/10 Add /Work Experience/ and update /Affiliation/, /Contact/, /Publications/, and /Award/
  - 2019/08/12 Update Affiliation, Contact, Degree, Publications, Award, and Other Activity sections
  - 2019/08/11 Move from http://www.osss.cs.tsukuba.ac.jp/~fukai to https://fukai-t.github.io/profile-page/
  - 2018/02/14 Update Affiliation, Research Interests, and Publications
  - 2016/03/14 Update Publications & Add other activity
  - 2015/12/11 Add English version page & Update Research Interests, Publications & Add Award
  - 2015/05/09 Add Affiliation, Degrees, and Publications
  - 2014/03/12 Open this page

