docs/profile_en.html

<li><a id="orge57bc51"></a>Steering Committee<br />
<div class="outline-text-3" id="text-orge57bc51">
<ul class="org-ul">
<li>April 2024&#x2013;Present: Secretary of IPSJ Special Interest Group on System Software and Operating Systems (SIGOS)<br /></li>
<li>April 2020&#x2013;March 2024: Committee member of IPSJ Special Interest Group on System Software and Operating Systems (SIGOS)<br /></li>
</ul>
</div>
</li>

<li><a id="org8b723a3"></a>Others<br />
<div class="outline-text-3" id="text-org8b723a3">
<ul class="org-ul">
<li>15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024). Sponsor Chair.<br /></li>
<li>The 3rd R-CCS International Symposium 2021. Online arrangement chair.<br /></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgef0fad0" class="outline-2">
<h2 id="orgef0fad0">Work Experience</h2>
<div class="outline-text-2" id="text-orgef0fad0">
<ul class="org-ul">
<li>October 2025&#x2013;Present: Senior Researcher in Intelligent Platforms Research Institute, National Institute of Advanced Industrial Science and Technology (AIST)<br /></li>
<li>April 2025&#x2013;September 2025: Researcher in Intelligent Platforms Research Institute, National Institute of Advanced Industrial Science and Technology (AIST)<br /></li>
<li>April 2022&#x2013;March 2025: Researcher in Digital Architecture Research Center, National Institute of Advanced Industrial Science and Technology (AIST)<br /></li>
<li>January 2020&#x2013;March 2022: Postdoctoral Researcher in RIKEN Center of Computational Science (R-CCS)<br /></li>
<li>April 2018-December 2019: Software Developer at IBM Japan<br />
<ul class="org-ul">
<li>Worked as QA engineer of a web application and DevOps engineer of a cloud productions<br /></li>
<li>Technical experience: Software test, CI/CD, Jenkins, Docker, Kubernetes, Helm<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9a0bd5d" class="outline-2">
<h2 id="org9a0bd5d">Other Activity</h2>
<div class="outline-text-2" id="text-org9a0bd5d">
<dl class="org-dl">
<dt>ResearchGate</dt><dd><a href="https://www.researchgate.net/profile/Takaaki_Fukai">https://www.researchgate.net/profile/Takaaki_Fukai</a><br /></dd>
<dt>Linkedin</dt><dd><a href="https://www.linkedin.com/in/takaaki-fukai-b378a7141/?originalSubdomain=jp">https://www.linkedin.com/in/takaaki-fukai-b378a7141/?originalSubdomain=jp</a><br /></dd>
<dt>Slideshare</dt><dd><a href="https://www.slideshare.net/DeepTokikane/presentations">https://www.slideshare.net/DeepTokikane/presentations</a><br /></dd>
<dt>Github</dt><dd><a href="https://github.com/fukai-t">https://github.com/fukai-t</a><br /></dd>
<dt>Bitbucket</dt><dd><a href="https://bitbucket.org/ftakaaki/">https://bitbucket.org/ftakaaki/</a><br /></dd>
</dl>
</div>
</div>
<div id="outline-container-org2a30e63" class="outline-2">
<h2 id="org2a30e63">Update History</h2>
<div class="outline-text-2" id="text-org2a30e63">
<ul class="org-ul">
<li>2026/03/10 Update <i>Affiliation</i>, <i>Publications</i>, <i>Research activities</i>, and <i>Work Experience</i><br /></li>
<li>2022/12/29 Update <i>Affiliation</i>, <i>Contact</i>, <i>Publications</i>, and <i>Work Experience</i><br /></li>
<li>2021/09/10 Add <i>Grants</i> and <i>Research activities</i>, Update <i>Work Experience</i> and <i>Publications</i><br /></li>
<li>2020/04/07 Update <i>Publications</i><br /></li>
<li>2020/03/10 Add <i>Work Experience</i> and update <i>Affiliation</i>, <i>Contact</i>, <i>Publications</i>, and <i>Award</i><br /></li>
<li>2019/08/12 Update Affiliation, Contact, Degree, Publications, Award, and Other Activity sections<br /></li>
<li>2019/08/11 Move from <a href="http://www.osss.cs.tsukuba.ac.jp/~fukai">http://www.osss.cs.tsukuba.ac.jp/~fukai</a> to <a href="https://fukai-t.github.io/profile-page/">https://fukai-t.github.io/profile-page/</a><br /></li>
<li>2018/02/14 Update Affiliation, Research Interests, and Publications<br /></li>
<li>2016/03/14 Update Publications &amp; Add other activity<br /></li>
<li>2015/12/11 Add English version page &amp; Update Research Interests, Publications &amp; Add Award<br /></li>
<li>2015/05/09 Add Affiliation, Degrees, and Publications<br /></li>
<li>2014/03/12 Open this page<br /></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Takaaki FUKAI</p>
<p class="date">Created: 2026-03-09 Mon 21:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
